Revit 2027 API
BuiltInFailures.CopyPasteFailures.CantCopyStairsLevelHeightNotMatchInMS Property
 Can't copy stairs in Multistory Stairs due to level height doesn't match.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantCopyStairsLevelHeightNotMatchInMS { get; }
Public Shared ReadOnly Property CantCopyStairsLevelHeightNotMatchInMS As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantCopyStairsLevelHeightNotMatchInMS {
	FailureDefinitionId^ get ();
}
static member CantCopyStairsLevelHeightNotMatchInMS : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace